DataProcessors/МенеджерИнтеграцииСРекрутинговымиСайтами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>МенеджерИнтеграцииСРекрутинговымиСайтами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МенеджерыСайтов</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сайты</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСайтов</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/МенеджерИнтеграцииСРекрутинговымиСайтами/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Параметры:
//  Сайты - Неопределено, СправочникСсылка.ИсточникиИнформацииОКандидатах, Массив из СправочникСсылка.ИсточникиИнформацииОКандидатах -
//  Пользователь - Неопределено, СправочникСсылка.Пользователи -
//  ТолькоНастроенные - Булево
// 
// Возвращаемое значение:
//  ОбработкаОбъект.МенеджерИнтеграцииСРекрутинговымиСайтами
Функция НовыйМенеджер(Сайты, Пользователь, ТолькоНастроенные = Истина) Экспорт
	
	Менеджер = Создать();
	
	Если ЗначениеЗаполнено(Пользователь) Или Не ТолькоНастроенные Тогда
		Менеджер.Пользователь = Пользователь;
	Иначе
		Менеджер.Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	СайтыМенеджера = Новый Массив();
	
	Если ТипЗнч(Сайты) = Тип("Массив") Тогда
		СайтыМенеджера = Сайты;
	ИначеЕсли ТипЗнч(Сайты) = Тип("СправочникСсылка.ИсточникиИнформацииОКандидатах") Тогда
		СайтыМенеджера = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сайты);
	ИначеЕсли ТипЗнч(Сайты) = Тип("ФиксированныйМассив") Тогда
		СайтыМенеджера = Новый Массив(Сайты);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СайтыМенеджера) Тогда
		Если ТолькоНастроенные Тогда
			Менеджер.Сайты = УдалитьНенастроенныеСайты(СайтыМенеджера, Менеджер.Пользователь);
		Иначе
			Менеджер.Сайты = Новый ФиксированныйМассив(СайтыМенеджера);
		КонецЕсли;
	Иначе
		Если ТолькоНастроенные Тогда
			Менеджер.Сайты = РекрутинговыеСайты.НастроенныеСайты(Менеджер.Пользователь);
		Иначе
			Менеджер.Сайты = РекрутинговыеСайты.ИспользуемыеСайты();
		КонецЕсли;
	КонецЕсли;
	
	Менеджер.МенеджерыСайтов = Новый Соответствие();
	ДанныеСайтов = Новый Соответствие();
	
	Для Каждого Сайт Из Менеджер.Сайты Цикл
		МенеджерСайта = РекрутинговыеСайтыВнутренний.НовыйМенеджерСайта(Сайт, Менеджер.Пользователь);
		
		Если МенеджерСайта = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.Проверить(Ложь,
				СтрШаблон(НСтр("ru = 'Не задан обработчик для сайта %1.'"), Сайт),
				НСтр("ru = 'РекрутинговыеСайтыВнутренний.НовыйМенеджерСайта'"));
		КонецЕсли;
		
		Менеджер.МенеджерыСайтов.Вставить(Сайт, МенеджерСайта);
		ДанныеСайтов.Вставить(Сайт, РекрутинговыеСайтыВнутренний.ДанныеСайта(Сайт));
	КонецЦикла;
	
	Менеджер.ДанныеСайтов = Новый ФиксированноеСоответствие(ДанныеСайтов);
	
	Возврат Менеджер;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  Сайты - Массив из СправочникСсылка.ИсточникиИнформацииОКандидатах
//  Пользователь - СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
//  ФиксированныйМассив из СправочникСсылка.ИсточникиИнформацииОКандидатах
Функция УдалитьНенастроенныеСайты(Сайты, Пользователь)
	
	Результат = Новый Массив();
	
	НастроенныеСайты = РекрутинговыеСайты.НастроенныеСайты(Пользователь);
	
	Для Каждого Сайт Из Сайты Цикл
		Если НастроенныеСайты.Найти(Сайт) <> Неопределено Тогда
			Результат.Добавить(Сайт);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Результат);
	
КонецФункции

#КонецОбласти

#КонецЕсли
